{
  "education": [
    {
      "awards_achievements": [
        "Faculty of Applied Science \u0026 Engineering Award of Excellence in Multidisciplinary Capstone Engineering Design - worth $2000",
        "Edward S. Rogers Sr. Admission Scholarship",
        "Faculty of Applied Science \u0026 Engineering Admission Scholarship",
        "Dean's List (2017, 2019): Obtained sessional average of at least 80%",
        "GPA: 3.22/4.0"
      ],
      "degree": "Bachelor of Applied Sciences",
      "department": "Electrical and Computer Engineering",
      "duration": "2017-2021",
      "school_name": "University of Toronto (St. George Campus)"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_TomasRotbauer",
  "highlighted_projects": [
    {
      "description": "Developped a Python script for automating database design decisions. Capable of functional dependency-set closure, minimization, BCNF decomposition and more.",
      "git_url": "https://github.com/tomasrotbauer/Database-Design-Toolkit",
      "name": "Database Design Toolkit"
    },
    {
      "description": "Developed fully functional, against-the-computer checkers game with intuitive GUI in C++ using SFML graphics library. Implemented Minimax algorithm with alpha-beta pruning capable of looking 12+ moves ahead in a timely manner which makes the AI virtually unbeatable by human players.",
      "git_url": "https://github.com/tomasrotbauer/checkers",
      "name": "Checkers Game with AI"
    },
    {
      "description": "Developed a Sudoku-solver program in Python featuring a user-friendly GUI implemented with TKinter. Capable of solving any and all Sudoku puzzles, regardless the difficulty level.",
      "git_url": "https://github.com/tomasrotbauer/sudoku-solver",
      "name": "Python Sudoku Solver"
    },
    {
      "description": "Developed a simple 3-layer neural network with Python and Numpy using the gradient descent with momentum algorithm for training. The program is capable of distinguishing between ten different letters from the notMNIST dataset.",
      "git_url": "https://github.com/tomasrotbauer/NeuralNetwork",
      "name": "Neural Network Implementation"
    },
    {
      "description": "Built a compiler for a subset of C fully capable of scanning, parsing and generating code. I Learned about Flex, GNU Bison and LLVM in this project.",
      "git_url": "https://github.com/tomasrotbauer/C-Compiler",
      "name": "C Compiler Implementation Project"
    },
    {
      "description": "Implemented fully functional custom processor in System Verilog with 16-bit pipelined architecture and 19 different instructions on the DE1-SoC Intel FPGA development board. Tested with custom assembly language programs to verify and test correctness of the implementation.",
      "name": "Custom Processor Design/Implementation"
    },
    {
      "description": "Designed and implemented a fun mini game with Verilog HDL on the DE1-SoC Intel FPGA. Short demo video clip link -\u003e https://www.youtube.com/watch?v=NfYLQWxKTjU\u0026feature=youtu.be",
      "name": "Jump Car Hardware Mini Game Project"
    },
    {
      "description": "Designed and engineered a more efficient aircraft braking technology for Safran Landing Systems on a multidisciplinary engineering team of five senior students. Helped with CAD-ing in SOLIDWORKS and ANSYS to simulate the design. Won best multidisciplinary capstone award, worth $2000. Project portfolio link -\u003e https://tomasrotbauer.wixsite.com/website",
      "name": "Multidisciplinary Capstone Design Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a minimum viable product (MVP) for demonstrating how hardware usage data could automatically be collected from Linux machines within a cluster and stored into a database. The design works primarily with Linux bash scripts which periodically obtain the necessary data and store it into a containerized PostgreSQL database instance.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a command line CRUD application capable of posting, viewing, and deleting tweets from a user's Twitter account. Learned Twitter REST API and leveraged HTTP for client-server communication. The application follows the MVC architecture and comprises multiple layers to facilitate development and testing. Spring Boot was used for dependency management, Docker for deployment, and Maven for building and packaging the application.",
        "JDBC App: Implemented a simple data access object (DAO) application using Java Database Connectivity (JDBC) API for accessing and running queries on a small relational database with a couple of tables. The application can perform all the fundamental CRUD (create, read, update \u0026 delete) operations on the local PostgreSQL instance via transactions.",
        "Grep App: Programmed with Java 8 and leveraged its latest features including the stream API and lambda functions to develop an application similar to the Linux built-in grep feature. The program searches recursively through a root directory to map out all files and finds the lines that match the user-specified Java regular expression. Compilation was handled with the Maven tool, and the final product was packaged into a Docker container using Dockerfiles."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Tomas Rotbauer",
  "others": [
    {
      "bullets": [
        "Coursera/Duke University - Java Programming: Solving Problems with Software. Link: https://www.coursera.org/account/accomplishments/certificate/7BGRZUB2EH2Q",
        "Coursera/Duke University - Programming Foundations with JavaScript, HTML and CSS (with Honours). Link: https://www.coursera.org/account/accomplishments/certificate/TSV3868USM7P",
        "HackerRank - Problem Solving (Intermediate). Link: https://www.hackerrank.com/certificates/677cfcea2b01",
        "HackerRank - Python (Basic). Link: https://www.hackerrank.com/certificates/6b4cfdf58445",
        "Honours certificate of bilingual studies in extended French"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "English",
        "French",
        "Czech"
      ],
      "title": "Languages"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed many different software applications for various data engineering projects. Examples of tools that I worked with include Java, SQL, Docker, Linux Bash and many other important technologies all while crafting solutions to real-world problems. Followed the Agile/Scrum team framework for team collaboration, and played the team lead role for several scrum ceremonies.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "C-Intech",
      "description": "Fabricated and installed specialized electromagnetic shielding panels on a team to block electromagnetic interference (EMI). Followed complex engineering schematics in order to meet critical fabrication and EMI shielding standards",
      "duration": "May-July 2018, 2019, 2020",
      "title": "Electromagnetic Shielding Intern"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "Maven",
      "Concurrent programming",
      "Neural networks",
      "Processor architecture",
      "Assembly Language"
    ],
    "familiar": [
      "JavaScript",
      "HTML/CSS",
      "TensorFlow",
      "LLVM",
      "GNU Bison",
      "Networking (OSI model)",
      "MATLAB"
    ],
    "proficient": [
      "Java",
      "C/C++",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "HTTP/REST API",
      "Agile/Scrum",
      "Git",
      "Algorithms and data structures",
      "Verilog HDL",
      "Linear algebra/calculus"
    ]
  },
  "summary": "I am a recent bachelor of applied science (BASc) graduate from the University of Toronto with a major in computer engineering. I specialized mostly in software, spanning from compiler development all the way to machine learning, as well as computer hardware and digital logic which allows me to understand how software runs at the processor level. As a software developer, I believe that being able to work with/understanding lower levels of abstraction behind a program is a prerequisite to writing highly optimized code. In my eyes, programming is not just a job but rather a skill and a personal hobby of mine that I enjoy practicing in my spare time. My countless personal and academic projects, as well as internship experience, demonstrate my wide background in software as well as the general engineering discipline. My experiences have taught me how to think outside the box when developing software, and I always strive to find the most optimized solution to the problem."
}
